Revit 2026 API

# RadioButtonGroup Class

---

Represents a group of related buttons in the Ribbon.

SystemObject Autodesk.Revit.UIRibbonItem Autodesk.Revit.UIRadioButtonGroup

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RadioButtonGroup : RibbonItem
```
```vb
Public Class RadioButtonGroup
	Inherits RibbonItem
```
```cpp
public ref class RadioButtonGroup : public RibbonItem
```
```fsharp
type RadioButtonGroup =
    class
        inherit RibbonItem
    end
```

The RadioButtonGroup type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets or sets the current checked ToggleButton of the RadioButtonGroup. |
|  | Enabled | Gets or sets a value indicating whether the item is enabled. (Inherited from RibbonItem) |
|  | ItemText | Gets or sets the text displayed on the item. (Inherited from RibbonItem) |
|  | ItemType | Gets the item type.(Inherited from RibbonItem) |
|  | LongDescription | Long description of the command tooltip (Inherited from RibbonItem) |
|  | Name | The name of the item.(Inherited from RibbonItem) |
|  | ToolTip | The description that appears as a ToolTip for the item.(Inherited from RibbonItem) |
|  | ToolTipImage | The image to show as a part of the button extended tooltip (Inherited from RibbonItem) |
|  | Visible | Gets or sets a value indicating whether the item is visible. (Inherited from RibbonItem) |

|  | Name | Description |
| --- | --- | --- |
|  | AddItem | Adds a new ToggleButton to the RadioButtonGroup. |
|  | AddItems |  |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from RibbonItem) |
|  | GetContextualHelp | Gets the contextual help bound with this control.(Inherited from RibbonItem) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetItems | Gets the collection of ToggleButtons assigned to the RadioButtonGroup. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetContextualHelp | Sets the contextual help bound with this button.(Inherited from RibbonItem) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class contains a collection of ToggleButtons. Only one of the ToggleButtons will appear active at a given time. When a different button is clicked in the UI the current ToggleButton will be changed, and the ToggleButton's external command will be invoked. Use of this class is not supported in Revit Macros.

#### Reference

Autodesk.Revit.UI Namespace